arvi-kris-cy/smartlock_psoc4-4000t_develop/source/rgb_led.c
/*******************************************************************************
 * File Name:   rgb_led.c
 *
 * Description: This file contains RGB led effect related functions.
 *
 *******************************************************************************
* Copyright 2021-2022, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
 ******************************************************************************/

/*******************************************************************************
* Include header files
*******************************************************************************/
#include "cy_pdl.h"
#include "cybsp.h"
//#include "cyhal.h"
#include "gpio.h"
#include "i2c.h"
#include "rgb_led.h"
#include "main.h"
#include "uart.h"
#include "wdt.h"


/*******************************************************************************
* User Configurable Macros
*******************************************************************************/


/*******************************************************************************
* Fixed Macros
*******************************************************************************/


/*******************************************************************************
* Global Definitions
*******************************************************************************/
pwm_config pwm_led_red;
pwm_config pwm_led_green;
pwm_config pwm_led_blue;

uint32_t local_counter = 0;
uint16_t fading_counter = 0;

uint32_t count_pwm = 0;
uint8_t pwm_led_active = 0;

bool lock_state = true;

extern volatile uint32_t p6_event_input;

extern APPLICATION_STATE capsense_state;
/*******************************************************************************
* Function Definitions
*******************************************************************************/

/*******************************************************************************
* Function Name: Get_dutyCycle
 ********************************************************************************
 * Summary:
 *  Get the duty cycle of the LED
 *
 * Return:
 *  uint16_t: Dutycycle
 *******************************************************************************/
uint16_t Get_dutyCycle(pwm_config *obj)
{
    return obj->dutyCycle;
}

/*******************************************************************************
 * Function Name: Set_dutyCycle
 ********************************************************************************
 * Summary:
 *  Updates the duty cycle of the LED
 *
 * Return:
 * None
 *******************************************************************************/
void Set_dutyCycle(pwm_config *obj, uint16_t dutycycle)
{
    obj->dutyCycle = dutycycle;
    obj->led_on_time = ((LED_PWM_FREQ_US * obj->dutyCycle) / 100);

    if(!obj->dutyCycle)
    {
        Cy_GPIO_Clr(obj->port, obj->pin);
    }
    else if(obj->dutyCycle == 100)
    {
        Cy_GPIO_Set(obj->port, obj->pin);
    }

    if(!pwm_led_active)
    {
        /* Update WDT match value for soft PWM if not already done */
        set_wdt_match_value(WDT_TIMEOUT_FAST);
    }

    pwm_led_active = 1;
}

/*******************************************************************************
 * Function Name: rgb_led_reset
 ********************************************************************************
 * Summary:
 *  Resets color of RGB leds
 *
 * Return:
 * None
 *******************************************************************************/
void rgb_led_reset()
{
    count_pwm = 0;

    set_pwm(0, 0, 0);
}

/*******************************************************************************
 * Function Name: set_pwm
 ********************************************************************************
 * Summary:
 *  Sets duty cycle of RGB leds
 *
 * Return:
 * None
 *******************************************************************************/
void set_pwm(uint16_t red_pwm,uint16_t green_pwm,uint16_t blue_pwm)
{
#if ENABLE_LED
    Set_dutyCycle(&pwm_led_red, red_pwm);
    Set_dutyCycle(&pwm_led_green,green_pwm);
    Set_dutyCycle(&pwm_led_blue, blue_pwm);
#endif
}

/*******************************************************************************
* Function Name: wdt_pwm_init
****************************************************************************/
cy_rslt_t wdt_pwm_init(pwm_config *obj,uint16_t duty_cycle,uint32_t gpio_pin,GPIO_PRT_Type* gpio_port )
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

