arvi-kris-cy/smartlock_psoc4-4000t_develop/source/rgb_led.c
    obj->port = gpio_port;
    obj->pin = gpio_pin;
    obj->dutyCycle = duty_cycle;
    obj->led_on_time = ((LED_PWM_FREQ_US*obj->dutyCycle)/SW_PWM_FREQ_US) / 100;
    obj->gpio_status = 0;

    return result;
}

/*******************************************************************************
 * Function Name: pwm_init
 ********************************************************************************
 * Summary:
 *  Initializes PWM
 *
 * Return:
 * Status of initialization
 *******************************************************************************/
cy_rslt_t pwm_init(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
#if ENABLE_LED
    result = wdt_pwm_init(&pwm_led_red, 0, KEYPADLED_RED_PIN, KEYPADLED_RED_PORT );
    result = wdt_pwm_init(&pwm_led_green, 0, KEYPADLED_GREEN_PIN, KEYPADLED_GREEN_PORT);
    result = wdt_pwm_init(&pwm_led_blue, 0, KEYPADLED_BLUE_PIN, KEYPADLED_BLUE_PORT);
#endif

    return result;
}

/*******************************************************************************
 * Function Name: set_red_led
 ********************************************************************************
 * Summary:
 *  Set LED color
 *
 * Return:
 * None
 *******************************************************************************/
void set_led_color(uint8_t led_color)
{
    if(led_color == RED_COLOR)
    {
        set_pwm(MAX_PWM_DUTYCYCLE, 0, 0);
    }
    else if(led_color == GREEN_COLOR)
    {
        set_pwm(0, MAX_PWM_DUTYCYCLE, 0);
    }
    else if(led_color == BLUE_COLOR)
    {
        set_pwm(0, 0, MAX_PWM_DUTYCYCLE);
    }

    fading_counter++;
}

/*******************************************************************************
 * Function Name: blink_red_led
 ********************************************************************************
 * Summary:
 *  Blinks red led
 *
 * Return:
 * None
 *******************************************************************************/
void blink_red_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(count_pwm, 0, 0);
    }
    else if (count_pwm < (2*MAX_PWM_DUTYCYCLE))
    {
    }
    else if (count_pwm >= (2*MAX_PWM_DUTYCYCLE))
    {
        uint32_t count_val = count_pwm - (2*MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm((MAX_PWM_DUTYCYCLE - count_val), 0, 0);
    }
    count_pwm += PWM_STEP_BLINK;
}


/*******************************************************************************
 * Function Name: dim_blink_red_led
 ********************************************************************************
 * Summary:
 *  Blinks red led with lower brightness
 *
 * Return:
 * None
 *******************************************************************************/
void dim_blink_red_led(void)
{
    if (count_pwm <= LOW_BATTERY_LED_DUTY_CYCLE)
    {
        set_pwm(count_pwm, 0, 0);
    }
    else if (count_pwm < (3*LOW_BATTERY_LED_DUTY_CYCLE))
    {
    }
    else if (count_pwm >= (3*LOW_BATTERY_LED_DUTY_CYCLE))
    {
        uint32_t count_val = count_pwm - (3*LOW_BATTERY_LED_DUTY_CYCLE);

        if (count_val >= LOW_BATTERY_LED_DUTY_CYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm((LOW_BATTERY_LED_DUTY_CYCLE - count_val), 0, 0);
    }

    count_pwm += PWM_STEP_LOW_BATT;
}


/*******************************************************************************
 * Function Name: blink_green_led
 ********************************************************************************
 * Summary:
 *  Blinks green led
 *
 * Return:
 * None
 *******************************************************************************/
void blink_green_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0, count_pwm, 0);
    }
    else if (count_pwm < (2*MAX_PWM_DUTYCYCLE))
    {
    }
    else if (count_pwm >= (2*MAX_PWM_DUTYCYCLE))
    {
        uint32_t count_val = count_pwm - (2*MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0, (MAX_PWM_DUTYCYCLE - count_val), 0);
    }
    count_pwm += PWM_STEP_BLINK;
}


/*******************************************************************************
 * Function Name: blink_blue_led
 ********************************************************************************
 * Summary:
 *  Blinks blue led
 *
 * Return:
 * None
 *******************************************************************************/
void blink_blue_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0, 0, count_pwm);
    }
    else if (count_pwm < (2*MAX_PWM_DUTYCYCLE))
    {
    }
    else if (count_pwm >= (2*MAX_PWM_DUTYCYCLE))
    {
        uint32_t count_val = count_pwm - (2*MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0, 0, (MAX_PWM_DUTYCYCLE - count_val));
    }
    count_pwm += PWM_STEP_BLINK;
}


/*******************************************************************************
 * Function Name: blink_white_led
 ********************************************************************************
 * Summary:
 *  Blinks white led
 *
 * Return:
 * None
 *******************************************************************************/
void blink_white_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(count_pwm, count_pwm, count_pwm);
    }
    else if (count_pwm < (2*MAX_PWM_DUTYCYCLE))
    {
    }
    else if (count_pwm >= (2*MAX_PWM_DUTYCYCLE))
    {
        uint32_t count_val = count_pwm - (2*MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

