arvi-kris-cy/smartlock_psoc4-4000t_develop/source/rgb_led.c
        set_pwm((MAX_PWM_DUTYCYCLE - count_val), (MAX_PWM_DUTYCYCLE - count_val), (MAX_PWM_DUTYCYCLE - count_val));
    }
    count_pwm += PWM_STEP_BLINK;
}


/*******************************************************************************
 * Function Name: blink_orange_led
 ********************************************************************************
 * Summary:
 *  Blinks led in orange color
 *
 * Return:
 * None
 *******************************************************************************/
void blink_orange_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0.8 * count_pwm, 0.4 * count_pwm, 0);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = count_pwm - MAX_PWM_DUTYCYCLE;

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0.8 * (MAX_PWM_DUTYCYCLE - count_val), 0.4 * (MAX_PWM_DUTYCYCLE - count_val), 0);
    }
    count_pwm += PWM_STEP_BLINK;
}


/*******************************************************************************
 * Function Name: blink_pink_led
 ********************************************************************************
 * Summary:
 *  Blinks led in purple color
 *
 * Return:
 * None
 *******************************************************************************/
void blink_pink_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0.8 * count_pwm, 0, 0.8 * count_pwm);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = count_pwm - MAX_PWM_DUTYCYCLE;

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0.8 * (MAX_PWM_DUTYCYCLE - count_val), 0, 0.8 * (MAX_PWM_DUTYCYCLE - count_val));
    }
    count_pwm += PWM_STEP_BLINK;
}


/*******************************************************************************
 * Function Name: fade_red_led
 ********************************************************************************
 * Summary:
 *  Fades red led
 *
 * Return:
 * None
 *******************************************************************************/
void fade_red_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(count_pwm, 0, 0);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = (count_pwm - MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm((MAX_PWM_DUTYCYCLE - count_val), 0, 0);
    }
    count_pwm += PWM_STEP_FADE;
}


/*******************************************************************************
 * Function Name: fade_green_led
 ********************************************************************************
 * Summary:
 *  Fades green led
 *
 * Return:
 * None
 *******************************************************************************/
void fade_green_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0, count_pwm, 0);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = (count_pwm - MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0, (MAX_PWM_DUTYCYCLE - count_val), 0);
    }
    count_pwm += PWM_STEP_FADE;
}


/*******************************************************************************
 * Function Name: fade_blue_led
 ********************************************************************************
 * Summary:
 *  Fades blue led
 *
 * Return:
 * None
 *******************************************************************************/
void fade_blue_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0, 0, count_pwm);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = (count_pwm - MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0, 0, (MAX_PWM_DUTYCYCLE - count_val));
    }
    count_pwm += PWM_STEP_FADE;
}


/*******************************************************************************
 * Function Name: fade_white_led
 ********************************************************************************
 * Summary:
 *  Fades LEDs in white color
 *
 * Return:
 * None
 *******************************************************************************/
void fade_white_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(count_pwm, count_pwm, count_pwm);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = (count_pwm - MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm((MAX_PWM_DUTYCYCLE - count_val), (MAX_PWM_DUTYCYCLE - count_val), (MAX_PWM_DUTYCYCLE - count_val));
    }
    count_pwm += PWM_STEP_FADE;
}


/*******************************************************************************
 * Function Name: fade_orange_led
 ********************************************************************************
 * Summary:
 *  Fades LEDs in orange color
 *
 * Return:
 * None
 *******************************************************************************/
void fade_orange_led(void) // rgb(80%, 40%, 0%)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0.8 * count_pwm, 0.4 * count_pwm, 0);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = (count_pwm - MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0.8 * (MAX_PWM_DUTYCYCLE - count_val), 0.4 * (MAX_PWM_DUTYCYCLE - count_val), 0);
    }
    count_pwm += PWM_STEP_FADE;
}


