arvi-kris-cy/smartlock_psoc4-4000t_develop/source/rgb_led.c
/*******************************************************************************
 * Function Name: fade_yellow_led
 ********************************************************************************
 * Summary:
 *  Fades yellow led
 *
 * Return:
 * None
 *******************************************************************************/
void fade_yellow_led(void) // 97%, 46%, 19%
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0.9 * count_pwm, 0.9 * count_pwm, 0 * count_pwm);
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = (count_pwm - MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm(0.9 * (MAX_PWM_DUTYCYCLE - count_val), 0.9 * (MAX_PWM_DUTYCYCLE - count_val), 0 * (MAX_PWM_DUTYCYCLE - count_val));
    }
    count_pwm += PWM_STEP_FADE;
}


/*******************************************************************************
 * Function Name: fade_pink_led
 ********************************************************************************
 * Summary:
 *  Fades pink led
 *
 * Return:
 * None
 *******************************************************************************/
void fade_pink_led(void)
{
    if (count_pwm <= MAX_PWM_DUTYCYCLE)
    {
        set_pwm(0.8*(count_pwm), 0, (0.8*count_pwm));
    }
    else if (count_pwm > MAX_PWM_DUTYCYCLE)
    {
        uint32_t count_val = (count_pwm - MAX_PWM_DUTYCYCLE);

        if (count_val >= MAX_PWM_DUTYCYCLE)
        {
            set_pwm(0, 0, 0);

            count_pwm = 0;
            fading_counter++;
            return;
        }

        set_pwm((0.8*(MAX_PWM_DUTYCYCLE - count_val)), 0, (0.8*(MAX_PWM_DUTYCYCLE - count_val)));
    }
    count_pwm += PWM_STEP_FADE;
}


/*******************************************************************************
 * Function Name: process_pwm_led
 ********************************************************************************
 * Summary:
 *  Processes event from P6
 *
 * Return:
 * None
 *******************************************************************************/
void process_pwm_led(void)
{
    extern volatile int proximity_status, prev_proximity_status;
    extern volatile int proximity_led_state;

    if(p6_event_input)
    {
        /* if there is a P6 event when proximity is
         * still active, clear all the variables
         * related to proximity active
         */
        if (1 == prev_proximity_status)
        {
            prev_proximity_status = 0;
            proximity_led_state = 0;

            /* LED on time out is over ridden by an event from P6 */
            UART_print_string("LED off due to [P6 event ");
            UART_print_data(p6_event_input);
            UART_print_string("]\r\n");
        }

        /* Note: do not use printf or other delays within this switch cases
         * this affects LED effects timing */
        switch (p6_event_input)
        {
        case 0:
            break;

        case bootup:
            if (fading_counter <= 10 && fading_counter >= 1)
            {
                set_led_color(RED_COLOR);
            }
            else if (fading_counter <= 20 && fading_counter >= 1)
            {
                set_led_color(GREEN_COLOR);
            }
            else if (fading_counter <= 30 && fading_counter >= 1)
            {
                set_led_color(BLUE_COLOR);
            }
            else if (fading_counter > 30)
            {
                lock_state = true; /* Reset local door state to locked */
                fading_counter = 0;
                p6_event_input = 0;

                rgb_led_reset();
            }

            break;

        case pairing_mode:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                fade_blue_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;

                rgb_led_reset();
            }
            break;

        case pairing_started:
            if (fading_counter <= 300 && fading_counter >= 1)
            {
                fade_blue_led();
            }
            else if (fading_counter > 300)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case pairing_done:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                blink_blue_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;

                rgb_led_reset();
            }
            break;

        case pairing_failed:
            switch (fading_counter)
            {
                case 1:
                case 3:
                    blink_blue_led();
                break;

                case 2:
                case 4:
                    blink_red_led();
                break;

                case 5:
                    fading_counter = 0;
                    p6_event_input = 0;
                    rgb_led_reset();
                break;
            }
            break;

        case wifi_connected:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                blink_white_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case matter_provision_success:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                blink_white_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case matter_provision_failed:
            switch (fading_counter)
            {
                case 1:
                case 3:
                    blink_white_led();
                break;

