arvi-kris-cy/smartlock_psoc4-4000t_develop/source/rgb_led.c
                case 2:
                case 4:
                    blink_red_led();
                break;

                case 5:
                    fading_counter = 0;
                    p6_event_input = 0;
                    rgb_led_reset();
                break;

            }
            break;

        case mqtt_connecting:
            if (fading_counter <= 2 && fading_counter >= 1)
            {
                fade_orange_led();
            }
            else if (fading_counter > 2)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case mqtt_connected:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                blink_orange_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case mqtt_disconnected:
            switch (fading_counter)
            {
                case 1:
                case 3:
                    blink_orange_led();
                break;

                case 2:
                case 4:
                    blink_red_led();
                break;

                case 5:
                    fading_counter = 0;
                    p6_event_input = 0;
                    rgb_led_reset();
                break;

            }
            break;

        case pin_new_configuration:
            if (fading_counter <= 2 && fading_counter >= 1)
            {
                fade_green_led();
            }
            else if (fading_counter >= 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case pin_correct: // this gets superceeded by 7.2
    //        if (fading_counter <= 3 && fading_counter >= 1)
    //        {
    //            blink_green_led();
    //        }
    //        else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
    //            rgb_led_reset();
            }
            break;

        case pin_incorrect:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                blink_red_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case pin_three_times_incorrect:
            if (fading_counter <= 10 && fading_counter >= 1)
            {
                blink_red_led();
            }
            else if (fading_counter > 10)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case pin_entry_disabled:
            if (fading_counter <= 10 && fading_counter >= 1)
            {
                blink_red_led();
            }
            else if (fading_counter > 10)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case nfc_add_new_card:
            if (fading_counter <= 30 && fading_counter >= 1)
            {
                fade_pink_led();
            }
            else if (fading_counter > 30)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case nfc_success:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                blink_green_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case nfc_failed:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                fade_red_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case nfc_provision_card:
            if (fading_counter <= 50 && fading_counter >= 1)
            {
                blink_pink_led();
            }
            else if (fading_counter > 50)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case nfc_block_cards:
            switch (fading_counter)
            {
                case 1:
                case 3:
                    blink_pink_led();
                break;

                case 2:
                case 4:
                    blink_red_led();
                break;

                case 5:
                    fading_counter = 0;
                    p6_event_input = 0;
                    rgb_led_reset();
                break;

            }
            break;

        case lock:
            lock_state = true;

            if (fading_counter <= 2 && fading_counter >= 1)
            {
                blink_red_led();
            }
            else if (fading_counter > 2)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case unlock:
            lock_state = false; /* Unlocked */

            if (fading_counter <= 2 && fading_counter >= 1)
            {
                blink_green_led();
            }
            else if (fading_counter > 2)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case battery_low:
            if (fading_counter <= 2 && fading_counter >= 1)
            {
                dim_blink_red_led();
            }
            else if (fading_counter > 2)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case battery_critical:
            if (fading_counter <= 3 && fading_counter >= 1)
            {
                dim_blink_red_led();
            }
            else if (fading_counter > 3)
            {
                fading_counter = 0;
                p6_event_input = 0;
                rgb_led_reset();
            }
            break;

        case factory_reset:
            switch (fading_counter)
            {
                case 1:
                case 3:
                    blink_green_led();
                break;

