arvi-kris-cy/smartlock_psoc4-4000t_develop/source/rgb_led.c
                case 2:
                case 4:
                    blink_red_led();
                break;

                case 5:
                    fading_counter = 0;
                    p6_event_input = 0;
                    rgb_led_reset();
                break;

            }

            break;

        default:
            UART_print_string("event on p4 :default pwm case and p6_event_input is");
            UART_print_data(p6_event_input);
            UART_print_string("\r\n");
            p6_event_input = 0;
            break;
        }
    }
    else if(1 == proximity_status)
    {
        /* If the proximity sensor is active */
        /* Turn on Proximity active led only if there is no
         * event from P6, this is to make sure
         * P6 event related RGB led effect is not disturbed
         * by Proximity active led
         */
        proximity_led_state = 1;
        prev_proximity_status = 1;
        capsense_prox_led(PROX_ACTIVE_LED_DUTY_CYCLE);
        /* Clear the LED ON counter value, to be used for Proximity LED timeout counting */
        clear_led_on_counter_value();
    }
    else if (1 == prev_proximity_status)
    {
        /* If the proximity sensor was active before and is not active now */
#if ENABLE_LED
        /* Keep the Proximity led ON till timeout value is reached */
        if(get_led_on_counter_value() >= PROX_LED_ON_TIMEOUT)
#endif
        {
            fading_counter = 1;
            prev_proximity_status = 0;
            /* Clear the LED ON counter value, to be used for Proximity LED fade OFF */
            clear_led_on_counter_value();
        }
    }
    else if(1 == proximity_led_state)
    {
        /* If the proximity LED was ON before and timeout has occurred */
        /* This is to make sure LED off is gradually done.
         * The LED duty cycle is stepped down with every WDT tick.
         * But, logic may not address gradual step down if
         * there is an adhoc event from P6
         */

        int cur_led_on_ctr_val = (PWM_STEP_FADE * get_led_on_counter_value());

        if (cur_led_on_ctr_val <= PROX_ACTIVE_LED_DUTY_CYCLE)
        {
            /* Reduce the LED PWM dutycycle gradually to zero */
            capsense_prox_led((PROX_ACTIVE_LED_DUTY_CYCLE - cur_led_on_ctr_val));
        }
        else
        {
            /* LED is off due to Time out */
            proximity_led_state = 0;
            capsense_prox_led(0);
            UART_print_string("LED off due to TO \r\n");
        }
    }
}


/*******************************************************************************
 * Function Name: capsense_prox_led
 ********************************************************************************
 * Summary:
 *  Controls proximity led
 *
 * Return:
 * None
 *******************************************************************************/
void capsense_prox_led(uint16_t duty_cycle)
{
#if ENABLE_LED
    if (false == lock_state)
    { /* Unlocked */
        set_pwm(0, duty_cycle, 0);
    }
    else
    { /* Locked */
        set_pwm(duty_cycle, 0, 0);
    }
#endif
}


/*******************************************************************************
 * Function Name: pwm_stop
 ********************************************************************************
 * Summary:
 *  Stops PWM  module
 *
 * Return:
 * Status of the action
 *******************************************************************************/
cy_rslt_t pwm_stop(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

#if ENABLE_LED
    Set_dutyCycle(&pwm_led_red, 0);
    Set_dutyCycle(&pwm_led_green, 0);
    Set_dutyCycle(&pwm_led_blue, 0);
#endif

    return result;
}


/*******************************************************************************
 * Function Name: pwm_start
 ********************************************************************************
 * Summary:
 *  Starts PWM module
 *
 * Return:
 * Status of the action
 *******************************************************************************/
cy_rslt_t pwm_start(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

#ifdef ENABLE_LED
    Set_dutyCycle(&pwm_led_red, 0);
    Set_dutyCycle(&pwm_led_green, 0);
    Set_dutyCycle(&pwm_led_blue, 0);
#endif

    return result;
}

#if ENABLE_LED_TEST
void Led_Blink_Test(void)
{
    /* Toggle the user LED state */

//    UART_print_string("RED LED Test\r\n");
    Cy_GPIO_Set(KEYPADLED_RED_PORT, KEYPADLED_RED_PIN);
    /* Wait for 500ms and Turn OFF LED */
    Cy_SysLib_Delay(500);
    Cy_GPIO_Clr(KEYPADLED_RED_PORT, KEYPADLED_RED_PIN);

//    UART_print_string("GREEN LED Test\r\n");
    Cy_GPIO_Set(KEYPADLED_GREEN_PORT, KEYPADLED_GREEN_PIN);
    /* Wait for 500ms and Turn OFF LED */
    Cy_SysLib_Delay(500);
    Cy_GPIO_Clr(KEYPADLED_GREEN_PORT, KEYPADLED_GREEN_PIN);

//    UART_print_string("BLUE LED Test\r\n\r\n");
    Cy_GPIO_Set(KEYPADLED_BLUE_PORT, KEYPADLED_BLUE_PIN);
    /* Wait for 500ms and Turn OFF LED */
    Cy_SysLib_Delay(500);
    Cy_GPIO_Clr(KEYPADLED_BLUE_PORT, KEYPADLED_BLUE_PIN);
}

#endif


/*******************************************************************************
* pwm_callback()
*******************************************************************************/
void pwm_callback(void)
{
    static uint16_t count_time = 0;

    /* Red LED */
    if((pwm_led_red.gpio_status == 1) && (pwm_led_red.dutyCycle != 100))
    {
        if(count_time >= pwm_led_red.led_on_time)
        {
            Cy_GPIO_Clr(pwm_led_red.port, pwm_led_red.pin);

            pwm_led_red.gpio_status = 0;
        }

    }
    else if((pwm_led_red.gpio_status == 0) && (pwm_led_red.dutyCycle != 0))
    {
        if(count_time <= pwm_led_red.led_on_time)
        {
            Cy_GPIO_Set(pwm_led_red.port, pwm_led_red.pin);

            pwm_led_red.gpio_status = 1;
        }
    }

    /* Green LED */
    if((pwm_led_green.gpio_status == 1) && (pwm_led_green.dutyCycle != 100))
    {
        if(count_time >= pwm_led_green.led_on_time)
        {
            Cy_GPIO_Clr(pwm_led_green.port, pwm_led_green.pin);
            pwm_led_green.gpio_status = 0;
        }

    }
    else if((pwm_led_green.gpio_status == 0) && (pwm_led_green.dutyCycle != 0))
    {
        if(count_time <= pwm_led_green.led_on_time)
        {
            Cy_GPIO_Set(pwm_led_green.port, pwm_led_green.pin);
            pwm_led_green.gpio_status = 1;
        }
    }

    /* Blue LED */
    if((pwm_led_blue.gpio_status == 1) && (pwm_led_blue.dutyCycle != 100))
    {
        if(count_time >= pwm_led_blue.led_on_time)
        {
            Cy_GPIO_Clr(pwm_led_blue.port, pwm_led_blue.pin);
            pwm_led_blue.gpio_status = 0;
        }

    }
    else if((pwm_led_blue.gpio_status == 0) && (pwm_led_blue.dutyCycle != 0))
    {
        if(count_time <= pwm_led_blue.led_on_time)
        {
            Cy_GPIO_Set(pwm_led_blue.port, pwm_led_blue.pin);
            pwm_led_blue.gpio_status = 1;
        }
    }

    count_time += SW_PWM_FREQ_US;

    if(count_time == LED_PWM_FREQ_US)
    {
        count_time = 0;
    }

    if ((pwm_led_red.dutyCycle != 0) || (pwm_led_green.dutyCycle != 0) || (pwm_led_blue.dutyCycle != 0))
    {
        pwm_led_active = 1;
        set_wdt_match_value(SW_PWM_FREQ_US);
    }
    else
    {
        count_time = 0;
        pwm_led_active = 0;

        /* Update WDT match value */
        if((capsense_state == ACTIVE_MODE) || (p6_event_input != 0))
        {
            set_wdt_match_value(WDT_TIMEOUT_FAST);
        }
        else
        {
            set_wdt_match_value(WDT_TIMEOUT_SLOW);
        }
    }
}

/* [] END OF FILE */
